HPDE-Tools/rice-timer/firmware-v4-rt1064/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MIMXRT1064xxxxA
package_id: MIMXRT1064DVL6A
mcu_data: ksdk2_0
processor_version: 14.0.0
external_user_signals: {}
pin_labels:
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: NEOPIXEL, identifier: neopixel;NEOPIXEL}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: BUTTON_A, identifier: btn_a;button_a;BUTTON_A}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: BUTTON_B, identifier: btn_b;button_b;BUTTON_B}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: IMU_CS, identifier: IMU_CS}
- {pin_num: L12, pin_signal: GPIO_AD_B1_04, label: IMU_INT, identifier: IMU_INT2;IMU_INT}
- {pin_num: B12, pin_signal: GPIO_B1_07, label: IMU_CLK, identifier: IMU_CLK}
- {pin_num: D12, pin_signal: GPIO_B1_05, label: IMU_MISO, identifier: IMU_MISO}
- {pin_num: C12, pin_signal: GPIO_B1_06, label: IMU_MOSI, identifier: IMU_MOSI}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: GPS_ANT_SENSE, identifier: GPS_ANT_SENSE}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: GPS_ANT_SEL, identifier: GPS_ANT_SEL}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: GPS_PPS, identifier: GPS_PPS}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: UART_TO_GPS, identifier: UART_TO_GPS}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: UART_FROM_GPS, identifier: UART_FROM_GPS}
- {pin_num: K10, pin_signal: GPIO_AD_B1_07, label: GPS_I2C_SCL, identifier: GPS_I2C_SCL}
- {pin_num: J12, pin_signal: GPIO_AD_B1_06, label: GPS_I2C_SDA, identifier: GPS_I2C_SDA}
power_domains: {DCDC_IN: '5.0', DCDC_IN_Q: '5.0', DCDC_LP: '1.0', DCDC_PSWITCH: '3.3', DCDC_SENSE: '1.0', NVCC_EMC: '3.3', NVCC_GPIO: '3.3', NVCC_SD0: '3.3', NVCC_SD1: '3.3',
  VDDA_ADC_3P3: '3.3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    InitPinsSys();
    InitPinsSdram();
    InitPinsSd();
    InitPinsFrontPanel();
    InitPinsImu();
    InitPinsGps();
    InitPinsCan();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
InitPinsSys:
- options: {callFromInitBoot: 'true', prefix: PINS_SYS_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: L14, peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_13, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    speed: MHZ_50, drive_strength: R0}
  - {pin_num: K14, peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_12, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    speed: MHZ_50, drive_strength: R0}
  - {pin_num: F12, peripheral: JTAG, signal: TCK, pin_signal: GPIO_AD_B0_07}
  - {pin_num: F14, peripheral: JTAG, signal: TDI, pin_signal: GPIO_AD_B0_09}
  - {pin_num: G13, peripheral: JTAG, signal: TDO, pin_signal: GPIO_AD_B0_10}
  - {pin_num: E14, peripheral: JTAG, signal: TMS, pin_signal: GPIO_AD_B0_06}
  - {pin_num: F13, peripheral: JTAG, signal: MOD, pin_signal: GPIO_AD_B0_08}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : InitPinsSys
 * Description   : 
 *
 * END ****************************************************************************************************************/
void InitPinsSys(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_06_JTAG_TMS,          /* GPIO_AD_B0_06 is configured as JTAG_TMS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_07_JTAG_TCK,          /* GPIO_AD_B0_07 is configured as JTAG_TCK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_08_JTAG_MOD,          /* GPIO_AD_B0_08 is configured as JTAG_MOD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_09_JTAG_TDI,          /* GPIO_AD_B0_09 is configured as JTAG_TDI */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_10_JTAG_TDO,          /* GPIO_AD_B0_10 is configured as JTAG_TDO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TX,        /* GPIO_AD_B0_12 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_13_LPUART1_RX,        /* GPIO_AD_B0_13 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TX,        /* GPIO_AD_B0_12 PAD functional properties : */
      0x011008U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_13_LPUART1_RX,        /* GPIO_AD_B0_13 PAD functional properties : */
      0x011008U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
}


