HPDE-Tools/rice-timer/firmware-v4-rt1064/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
InitPinsCan:
- options: {callFromInitBoot: 'true', prefix: PINS_CAN_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: M13, peripheral: CAN1, signal: RX, pin_signal: GPIO_AD_B1_09, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable, speed: MHZ_50,
    drive_strength: Disabled, slew_rate: Slow}
  - {pin_num: H13, peripheral: CAN1, signal: TX, pin_signal: GPIO_AD_B1_08, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable, speed: MHZ_50,
    drive_strength: R0_4, slew_rate: Slow}
  - {pin_num: A13, peripheral: CAN2, signal: RX, pin_signal: GPIO_B1_09, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable, speed: MHZ_50,
    drive_strength: Disabled, slew_rate: Slow}
  - {pin_num: A12, peripheral: CAN2, signal: TX, pin_signal: GPIO_B1_08, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable, speed: MHZ_50,
    drive_strength: R0_4, slew_rate: Slow}
  - {pin_num: G10, peripheral: CAN3, signal: RX, pin_signal: GPIO_AD_B0_11, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable, speed: MHZ_50,
    drive_strength: Disabled, slew_rate: Slow}
  - {pin_num: H14, peripheral: CAN3, signal: TX, pin_signal: GPIO_AD_B0_14, hysteresis_enable: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable, speed: MHZ_50,
    drive_strength: R0_4, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : InitPinsCan
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void InitPinsCan(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_11_FLEXCAN3_RX,       /* GPIO_AD_B0_11 is configured as FLEXCAN3_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_14_FLEXCAN3_TX,       /* GPIO_AD_B0_14 is configured as FLEXCAN3_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_08_FLEXCAN1_TX,       /* GPIO_AD_B1_08 is configured as FLEXCAN1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_09_FLEXCAN1_RX,       /* GPIO_AD_B1_09 is configured as FLEXCAN1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_08_FLEXCAN2_TX,          /* GPIO_B1_08 is configured as FLEXCAN2_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_09_FLEXCAN2_RX,          /* GPIO_B1_09 is configured as FLEXCAN2_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_11_FLEXCAN3_RX,       /* GPIO_AD_B0_11 PAD functional properties : */
      0x015000U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: output driver disabled;
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_14_FLEXCAN3_TX,       /* GPIO_AD_B0_14 PAD functional properties : */
      0x011020U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/4
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_08_FLEXCAN1_TX,       /* GPIO_AD_B1_08 PAD functional properties : */
      0x011020U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/4
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_09_FLEXCAN1_RX,       /* GPIO_AD_B1_09 PAD functional properties : */
      0x011000U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: output driver disabled;
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_08_FLEXCAN2_TX,          /* GPIO_B1_08 PAD functional properties : */
      0x011020U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/4
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_09_FLEXCAN2_RX,          /* GPIO_B1_09 PAD functional properties : */
      0x011000U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: output driver disabled;
                                                 Speed Field: low(50MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
InitPinsDebug:
- options: {callFromInitBoot: 'false', prefix: PINS_DEBUG_, coreID: core0, enableClock: 'true', fullInit: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : InitPinsDebug
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void InitPinsDebug(void) {
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
